ib2b-documentation/output/services/managespinventory/updateInventory/Exception - Missing Mandatory Attribute/00_updateInventoryRequest.xml

<?xml version="1.0" encoding="UTF-8"?><!--
	@operation updateInventory
	@action requestInventoryAmend
	@sender EPS
	@receiver FLS
	@scenario Amend inventory fails - Missing mandatory attribute
	@name Exception - Amend inventory fails - Missing mandatory attribute
	@description This is a sample request message for the scenario: Amend inventory fails due to a missing mandatory attribute
	@version V1.0
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:dns="http://www.nbnco.com.au/cim/manageSPInventory/v5"
	xmlns:mhe="http://www.nbnco.com.au/cim/common/messageHeader/v3">
	<soapenv:Header>
		<mhe:MessageHeader>
			<activityName>updateInventory</activityName>
			<msgName>ManageSPInventoryupdateInventoryRequest</msgName>
			<businessServiceName>ManageSPInventory</businessServiceName>
			<businessServiceVersion>V1.0</businessServiceVersion>
			<msgType>Request</msgType>
			<accessSeekerID>SDP000000000001</accessSeekerID>
			<correlationId>4eef4405-606e-46db-8c5c-af78e2874077</correlationId>
			<security>Placeholder Security</security>
			<priority>6</priority>
			<communicationPattern>RequestReply</communicationPattern>
			<timestamp>2014-08-18T12:00:01Z</timestamp>
			<businessChannel>B2B</businessChannel>
			<HeaderCharacteristicValue>
				<value>FALSE</value>
				<Characteristic>
					<name>Mocked</name>
				</Characteristic>
			</HeaderCharacteristicValue>
			<!-- The B2B gateway may send multiple (undefined) characteristics that should be echoed back in the response from Fulfilment -->
			<HeaderCharacteristicValue>
				<value>EPS-NBNCO-PROD-0004</value>
				<Characteristic>
					<name>cpaId</name>
					<type>String</type>
				</Characteristic>
			</HeaderCharacteristicValue>
			<HeaderCharacteristicValue>
				<value>SDP000000000001</value>
				<Characteristic>
					<name>fromPartner</name>
					<type>String</type>
				</Characteristic>
			</HeaderCharacteristicValue>
		</mhe:MessageHeader>
	</soapenv:Header>
	<soapenv:Body>
		<dns:ManageSPInventoryRequest>
			<SPInventory>
				<!-- Note it is commented out here deliberately to demonstrate a ValidationException -->
				<!-- <ID>ORD000000000001</ID> -->
				<interactionDate>2014-08-18T12:00:00.000Z</interactionDate>
				<SPInventoryComprisedOf>
					<!-- NSAS or NWAS -->
					<ItemInvolvesProduct>
						<type>NSAS</type>
					</ItemInvolvesProduct>
					<!-- Below are the attributes that are changing. Also need to specify enough ids to make the tree complete for lower level items (TBD) -->
					<!-- TBD not sure if actions are relevant? -->
					<!-- Example here is just some AVC attributes changing -->
					<ReferencesSPInventoryItem>
						<ItemInvolvesResource>
							<ID>NTD000000000001</ID>
							<type>NTD</type>
						</ItemInvolvesResource>
						<ReferencesSPInventoryItem>
							<ItemInvolvesResource>
								<ID>UNI000000000001</ID>
								<type>UNID</type>
							</ItemInvolvesResource>
							<ReferencesSPInventoryItem>
								<ItemInvolvesService>
									<ID>AVC000000000001</ID>
									<DescribedBy>
										<value>CVC000000000002</value>
										<Characteristic>
											<ID>cvcId</ID>
										</Characteristic>
									</DescribedBy>
									<DescribedBy>
										<value>True</value>
										<Characteristic>
											<ID>enableEncryption</ID>
										</Characteristic>
									</DescribedBy>
									<type>AVCM</type>
								</ItemInvolvesService>						
							</ReferencesSPInventoryItem>
						</ReferencesSPInventoryItem>
					</ReferencesSPInventoryItem>
				</SPInventoryComprisedOf>
			</SPInventory>
		</dns:ManageSPInventoryRequest>
	</soapenv:Body>
</soapenv:Envelope>